[
  {
    "clause": "Party, so long as any such archival or electronic file back-up copies are accessible only to its legal or IT personnel, provided that such Confidential Information will continue to be subject to the terms of this Agreement.\n\n12.5 Tail Period. Solely in the event that Dova has terminated this Agreement pursuant to Section 12.3.1 and notwithstanding anything else herein, in consideration of the promotion services performed by Valeant during the Term, with respect to the Tail Period, Dova shall make payments to Valeant in an amount equal to [***] of the amounts that would have been payable by Dova to Valeant with respect to such Tail Period pursuant to Section 6.1 had the Agreement not been so terminated. Such payments shall be made within [***] following the end of each calendar quarter in the Tail Period. Sections 6.3, 6.4 and 6.5 shall apply, mutatis mutandis, to such Tail Period payments. For clarity, no tail payment shall be due following",
    "question": "Highlight the parts (if any) of this contract related to \"Liquidated Damages\" that should be reviewed by a lawyer. Details: Does the contract contain a clause that would award either party liquidated damages for breach or a fee upon the termination of a contract (termination fee)?",
    "evidence": "Solely in the event that Dova has terminated this Agreement pursuant to Section 12.3.1 and notwithstanding anything else herein, in consideration of the promotion services performed by Valeant during the Term, with respect to the Tail Period, Dova shall make payments to Valeant in an amount equal to [***] of the amounts that would have been payable by Dova to Valeant with respect to such Tail Period pursuant to Section 6.1 had the Agreement not been so terminated."
  },
  {
    "clause": "Subcontractor or its personnel have contact as a result of Subcontractor's performance of this Agreement, unless Subcontractor (i) obtains the written consent of EDGE, as applicable, and (ii) pays EDGE as applicable a fee to be mutually agreed upon. In the event Subcontractor directly employs or contracts with an employee of EDGE without the consent of EDGE, Subcontractor shall pay as liquidated damages two times the then monthly salary of the employee for a three-month period of time.\n\nSTRATEGIC ALLIANCE AGREEMENT \"EDGE-FTE\"  Page 13\n\n  35. DOCUMENT OWNERSHIP AND CONFIDENTIALITY AND USE OF INFORMATION   Each party may make available (\"Disclosing Party\") to the other (\"Receiving Party\") access to certain information",
    "question": "Highlight the parts (if any) of this contract related to \"Liquidated Damages\" that should be reviewed by a lawyer. Details: Does the contract contain a clause that would award either party liquidated damages for breach or a fee upon the termination of a contract (termination fee)?",
    "evidence": "In the event Subcontractor directly employs or contracts with an employee of EDGE without the consent of EDGE, Subcontractor shall pay as liquidated damages two times the then monthly salary of the employee for a three-month period of time."
  }
]