[
  {
    "clause": "Hundred  Thousand Dollars  ($500,000),  the form of which is  attached  hereto  as  Exhibit  A and incorporated  herein by reference.  The LC shall have a two (2) month term,  and shall be renewed  for five (5)  consecutive  bimonthly  periods.  A minimum of a $250,000.00  purchase  order  must be  received  by Company by the first of each month for a total (12) month  period.  The Company may draw funds from the LC to pay for  Distributor's  purchases,  which are not paid according to the terms in Section 2.7. Prices for the EnergySaver units are\n\n                                    Page -2-\n\nprovided  by the",
    "question": "Highlight the parts (if any) of this contract related to \"Minimum Commitment\" that should be reviewed by a lawyer. Details: Is there a minimum order size or minimum amount or units per-time period that one party must buy from the counterparty under the contract?",
    "evidence": "A minimum of a $250,000.00  purchase  order  must be  received  by Company by the first of each month for a total (12) month  period."
  },
  {
    "clause": "same repayment schedule as provide in paragraph 8A below.\n\n[***** ]  Confidential Material redacted and filed separately with the Commission.   4\n\n  8. MINIMUM NUMBER OF TOURNAMENTS AND POTENTIAL REPAYMENT OF BASE COMPENSATION\n\n    A.  In each and every calendar year of this Agreement, CONSULTANT shall achieve a satisfactory record of play in a minimum of [* ****] professional golf association events on the SPGA and/or PGA tour (which shall include both the PGA and SPGA Tour Skins Games). If for any reason, CONSULTANT should achieve a satisfactory record of play in less than [*****] SPGA and/or PGA tour events in a calendar year, he shall repay ADAMS GOLF an amount per event for each event under [*****] achieved in the given",
    "question": "Highlight the parts (if any) of this contract related to \"Minimum Commitment\" that should be reviewed by a lawyer. Details: Is there a minimum order size or minimum amount or units per-time period that one party must buy from the counterparty under the contract?",
    "evidence": "In each and every calendar year of this Agreement, CONSULTANT shall achieve a satisfactory record of play in a minimum of [* ****] professional golf association events on the SPGA and/or PGA tour (which shall include both the PGA and SPGA Tour Skins Games)."
  }
]