[
  {
    "clause": "or any other statute.\n\nTERM AND TERMINATION\n\nThe term of this Agreement for the Hosted Site shall commence upon April 1, 1999 and shall continue for a period of six (6) months, unless earlier terminated in accordance with provisions hereof. This Agreement shall automatically be renewed for one (1) or more one (1) month periods unless either the Customer or i-on gives notice to the other party of its intention not to renew the\n\n4 Agreement, which notice must be given not less than fifteen (15) days before the end of the respective initial or renewal term.\n\nEither party may terminate this Agreement without cause at any time effective upon thirty (30) days' written",
    "question": "Highlight the parts (if any) of this contract related to \"Notice Period To Terminate Renewal\" that should be reviewed by a lawyer. Details: What is the notice period required to terminate renewal?",
    "evidence": "This Agreement shall automatically be renewed for one (1) or more one (1) month periods unless either the Customer or i-on gives notice to the other party of its intention not to renew the"
  },
  {
    "clause": "expiration of the last valid claim in the PPI Patents covering the Product in any country of the Territory (the \"Initial Term\"). Thereafter  the term of this Agreement shall automatically renew for consecutive periods of two (2) years each. Notwithstanding the foregoing, this  Agreement can be terminated by EKR at the end of the Initial Term by delivery of written notice to PPI at least one hundred eighty (180)  days prior to the end of the Initial Term or any renewal term. As used herein \"Term\" refers to the Initial Term and any renewal terms.\n\n16. Termination   16.1 Prior Termination by Either Party. Either Party shall be entitled forthwith to terminate this Agreement by notice to the",
    "question": "Highlight the parts (if any) of this contract related to \"Notice Period To Terminate Renewal\" that should be reviewed by a lawyer. Details: What is the notice period required to terminate renewal?",
    "evidence": "Notwithstanding the foregoing, this  Agreement can be terminated by EKR at the end of the Initial Term by delivery of written notice to PPI at least one hundred eighty (180)  days prior to the end of the Initial Term or any renewal term."
  }
]