[
  {
    "clause": "Information of the other party provided,         however, Corio may retain any Confidential Information necessary for         Corio to continue supporting it's then-existing Customers.\n\n12      SOURCE CODE ESCROW.\n\n12.1    Escrow Account. Within sixty (60) days of the Effective Date, Commerce         One agrees to execute an escrow agreement by and among Corio, Commerce         One and a mutually acceptable escrow agent (the \"ESCROW AGENT\"). The         Escrow Agent shall require Commerce One to place in an\n\n                                    10\n\n11         escrow account in California a copy of the source code of the Software\n\n     including all Updates and Upgrades thereto",
    "question": "Highlight the parts (if any) of this contract related to \"Source Code Escrow\" that should be reviewed by a lawyer. Details: Is one party required to deposit its source code into escrow with a third party, which can be released to the counterparty upon the occurrence of certain events (bankruptcy,  insolvency, etc.)?",
    "evidence": "Within sixty (60) days of the Effective Date, Commerce         One agrees to execute an escrow agreement by and among Corio, Commerce         One and a mutually acceptable escrow agent (the \"ESCROW AGENT\")."
  },
  {
    "clause": "yield or quality (\"Release Condition\"), the Escrow Agent will, in accordance with the terms of the escrow agreement between the parties and the Escrow Agent (the \"Escrow Agreement\"), release the Deposit Materials to DIALOG.   16.3 License. ENERGOUS hereby grants DIALOG a non-exclusive, non-transferable (except as set forth in Section 2) license under the Product IP to use any of the Deposit Materials released from escrow for the purpose of fixing an Epidemic Defect or other Product design or production issue impacting yield or quality during the Term and, if applicable, any Wind Down Period or Continuing Obligation period, including, but not limited to, authorizing any third party subcontractor to manufacture and supply Products, provided, however, that DIALOG continues to make all Royalty payment owed to ENERGOUS (or the then-current owner of the Product IP) as provided in this Agreement. No Service Fees will be payable under this license. DIALOG agrees not to exercise such license until occurrence of a Release Condition, subject to the other restrictions set forth in this Section 16. Such license may be exercised by DIALOG",
    "question": "Highlight the parts (if any) of this contract related to \"Source Code Escrow\" that should be reviewed by a lawyer. Details: Is one party required to deposit its source code into escrow with a third party, which can be released to the counterparty upon the occurrence of certain events (bankruptcy,  insolvency, etc.)?",
    "evidence": "ENERGOUS hereby grants DIALOG a non-exclusive, non-transferable (except as set forth in Section 2) license under the Product IP to use any of the Deposit Materials released from escrow for the purpose of fixing an Epidemic Defect or other Product design or production issue impacting yield or quality during the Term and, if applicable, any Wind Down Period or Continuing Obligation period, including, but not limited to, authorizing any third party subcontractor to manufacture and supply Products, provided, however, that DIALOG continues to make all Royalty payment owed to ENERGOUS (or the then-current owner of the Product IP) as provided in this Agreement."
  }
]