[
  {
    "clause": "Sunday afternoon or Monday morning following the tournament. In all such interviews and appearances, CONSULTANT will use his best efforts to make reference to the ADAMS GOLF PRODUCT and wear [*****] and display ADAMS GOLF'S brand name.\n\nB.During  the term of this Agreement, CONSULTANT  shall make himself available on not more than [*****]  days for television and radio commercials, photo shoots, modeling and  promotional appearances compatible with CONSULTANT'S  own practice, play and personal time requirements. Said activities shall  be directly related to the promotion of ADAMS GOLF PRODUCT. ADAMS GOLF  shall  reimburse CONSULTANT  for reasonable travel expenses for CONSULTANT when making special appearances for ADAMS GOLF pursuant to this paragraph",
    "question": "Highlight the parts (if any) of this contract related to \"Volume Restriction\" that should be reviewed by a lawyer. Details: Is there a fee increase or consent requirement, etc. if one party’s use of the product/services exceeds certain threshold?",
    "evidence": "During  the term of this Agreement, CONSULTANT  shall make himself available on not more than [*****]  days for television and radio commercials, photo shoots, modeling and  promotional appearances compatible with CONSULTANT'S  own practice, play and personal time requirements."
  },
  {
    "clause": "Prioritize and support clinical product pipeline business priorities • Work closely with executive team to ensure department initiatives are all aligned • Locate, evaluate and develop new business contacts and opportunities\n\n2. Compensation. The Company will compensate Consultant at the rate of $400 per hour (19 hours cap monthly; anything over these hrs must be preapproved by management), payable in accordance with the Company's standard payroll schedule, and subject to withholding as legally required. This compensation will be subject to adjustment pursuant to the Company's consultant compensation policies in effect from time to time. Consultants shall be given written notice of any adjustments to compensation at least fourteen (14) days",
    "question": "Highlight the parts (if any) of this contract related to \"Volume Restriction\" that should be reviewed by a lawyer. Details: Is there a fee increase or consent requirement, etc. if one party’s use of the product/services exceeds certain threshold?",
    "evidence": "The Company will compensate Consultant at the rate of $400 per hour (19 hours cap monthly; anything over these hrs must be preapproved by management), payable in accordance with the Company's standard payroll schedule, and subject to withholding as legally required."
  }
]